**Reading the CSV file**

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
path=r"C:\Users\USER\Naresh IT\filehandling\visadataset.csv"

In [3]:
pd.read_csv(path)

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,Certified

In [4]:
path=r"C:\Users\USER\Naresh IT\filehandling\visadataset.csv"
pd.read_csv(path,
            sep=';')

      case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0      EZYV01,Asia,High School,N,N,14513,2007,West,59...
1      EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,8...
2      EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122...
3      EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434....
4      EZYV05,Africa,Master's,Y,N,1082,2005,South,149...
...                                                  ...
25475  EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,...
25476  EZYV25477,Asia,High School,Y,N,3274,2006,North...
25477  EZYV25478,Asia,Master's,Y,N,1121,1910,South,14...
25478  EZYV25479,Asia,Master's,Y,Y,1918,1887,West,861...
25479  EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwes...

[25480 rows x 1 columns]

**Create dataframes using list**

In [5]:
name=['Ramesh','Suresh','Sathish']
age=[30,35,40]
name,age

(['Ramesh', 'Suresh', 'Sathish'], [30, 35, 40])

***Step-1***

$create dataframe$

In [6]:
pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

$step-2$

- provide data

In [7]:
pd.DataFrame(zip(name,age))

         0   1
0   Ramesh  30
1   Suresh  35
2  Sathish  40

**step-3**

- provide columns

In [8]:
data=(zip(name,age))
cols=['Name','Age']
pd.DataFrame(data,columns=cols)

      Name  Age
0   Ramesh   30
1   Suresh   35
2  Sathish   40

**step-4**

- provide index

In [9]:
data=zip(name,age)
cols=['Name','Age']
ind=['A','B','C']
pd.DataFrame(data,
             columns=cols,
            index=ind)

      Name  Age
A   Ramesh   30
B   Suresh   35
C  Sathish   40

**Step-5**
- add new column

In [10]:
name=['Ramesh','Suresh','Sathish']
age=[30,35,40]

data=zip(name,age)
cols=['Name','Age']
ind=['A','B','C']
df=pd.DataFrame(data,
             columns=cols,
            index=ind)
df

      Name  Age
A   Ramesh   30
B   Suresh   35
C  Sathish   40

- if you want to add new column

- df['new column']

- you need to have a list which is having some elements

- that elements need to equal to numbers of rows 

- city_names=['Hyd','Blr','Chennai']

- df['city']=city_names

In [11]:
city_names=['Hyd','Blr','Chennai']
df['city']=city_names
df

      Name  Age     city
A   Ramesh   30      Hyd
B   Suresh   35      Blr
C  Sathish   40  Chennai



**step-6**
- update the existing collumn

In [12]:
df['Name']=['vinny','aishu','vamika']
df

     Name  Age     city
A   vinny   30      Hyd
B   aishu   35      Blr
C  vamika   40  Chennai

**step-7**

 $drop the colummn$
    
- inorder to drop the column

- we need to use drop method

- it takes 3 parameters
    - drop column or row
    - mention the column name
    - axis
        - axis=1 reference as column
        - axis=0 reference as row
    - you want to create a new dataframe or
    - you want overwrite the existing dataframe
    - inplace= True

In [13]:
df.drop('city',
        axis=1,
        inplace=True)

In [14]:
df

     Name  Age
A   vinny   30
B   aishu   35
C  vamika   40

In [18]:
name=['Ramesh','Suresh','Sathish']
age=[30,35,40]

data=zip(name,age)
cols=['Name','Age']
ind=['A','B','C']
df=pd.DataFrame(data,
             columns=cols,
            index=ind)


df

      Name  Age
A   Ramesh   30
B   Suresh   35
C  Sathish   40

In [19]:
df.drop('C',
       axis=0,
       inplace=True)

df

     Name  Age
A  Ramesh   30
B  Suresh   35

**step-9**

- save the data

In [22]:
df.to_csv("output.csv")
df.to_excel("output.xlsx")

In [23]:
pd.read_csv("output.csv")

  Unnamed: 0    Name  Age
0          A  Ramesh   30
1          B  Suresh   35

**step-10**

- Remove the index

In [25]:
df.to_csv("output.csv",index=False)

In [26]:
pd.read_csv("output.csv")

     Name  Age
0  Ramesh   30
1  Suresh   35

**Create dataframe using dictionary**

In [27]:
d1={"NAME":['Ramesh','Suresh','Sathish'],
   "AGE":[30,35,40]}
pd.DataFrame(d1)

      NAME  AGE
0   Ramesh   30
1   Suresh   35
2  Sathish   40